
arcana = {1: "Маг", 2: "Верховная Жрица", 3: "Императрица", 4: "Император", 5: "Иерофант", 6: "Влюбленные",
          7: "Колесница", 8: "Правосудие", 9: "Отшельник", 10: "Колесо фортуны", 11: "Сила", 12: "Повешенный",
          13: "Смерть", 14: "Умеренность", 15: "Дьявол", 16: "Башня", 17: "Звезда", 18: "Луна", 19: "Солнце",
          20: "Суд", 21: "Мир", 22: "Шут"}

def calculate_arcana(day: int, month: int, year: int):
    a = day + month + sum(list(map(int, list(str(year)))))
    if a > 22:
        return a - 22
    return a